age = int(input('1.คุณอายุเท่าไหร่: '))
if age > 120:
    print('ฮาว่าเริ่มบ่จั้ย')
elif age >= 18:
    print('สามารถเข้าได้')
else:
    print('ไม่สามารถเข้าได้')
print('__________________________________')
num = float(input('2.นำเข้าตัวเลข: '))
if num > 0:
    print('เป็นเลขบวก')
if num < 0:
    print('เป็นเลขลบ')
if num == 0:
    print('เป็นเลขศูนย์')
print('__________________________________')
age2 = int(input('3.คุณอายุเท่าไหร่: '))
if age2 > 120:
    print('ฮาว่าเริ่มบ่จั้ย')
elif (age2 > 17) and (age2 < 26):
    print('อายุ',age2,'อยู่ในช่วง 18-25')
else:
    print('อายุ',age2,'ไม่อยู่ในช่วง 18-25')
print('__________________________________')
num2 = float(input('4.นำเข้าตัวเลข: '))
if (num2>-10) and (num2<10):
    print('เลขมีหนึ่งหลัก')
else:
    print('เลขมีมากกว่าหนึ่งหลัก')
print('__________________________________')
x = float(input('ระบุค่า x: '))
y = float(input('ระบุค่า y: '))
z = float(input('ระบุค่า z: '))
if x == y == z:
    print('มีค่าเท่ากัน')
else:
    print('มีค่าไม่เท่ากัน')
print('__________________________________')